{
  "home": [
    "<h2>KEA 4th-Semester Assigment Node JS</h2>",
    "<hr>",
    "<p>class: DAT18I</p>",
    "<p>author: Marian Gheorghe Mocanu</p>"
  ],
  "jQuery": [
    "<h2>What is jQuery?</h2>",
    "<p>jQuery is a lightweight, &quot;write less, do more&quot;, JavaScript library.</p>",
    "<p>The purpose of jQuery is to make it much easier to use JavaScript on your website.</p>",
    "<p>jQuery takes a lot of common tasks that require many lines of JavaScript code to accomplish, and wraps them into methods that you can call with a single line of code.</p>",
    "<p>jQuery also simplifies a lot of the complicated things from JavaScript, like AJAX calls and DOM manipulation.</p>",
    "<p>The jQuery library contains the following features:</p>",
    "<ul>",
    "<li>HTML/DOM manipulation</li>",
    "<li>CSS manipulation</li>",
    "<li>HTML event methods</li>",
    "<li>Effects and animations</li>",
    "<li>AJAX</li>",
    "<li>Utilities</li>",
    "</ul>",
    "<p><b>Tip:</b> In addition, jQuery has plugins for almost any task out there.</p>"
  ],
  "introNodeJs": [
    "<h2>What is Node.js?</h2>",
    "<p>Node. js is a platform built on Chrome's JavaScript runtime for easily building fast and scalable network applications. ",
    "Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient, perfect for data-intensive real-time applications that run across distributed devices.</p>",
    "<ul>",
    "<li>Node.js is an open source server environment</li>",
    "<li>Node.js is free</li>",
    "<li>Node.js runs on various platforms (Windows, Linux, Unix, Mac OS X, etc.)</li>",
    "<li>Node.js uses JavaScript on the server</li>",
    "</ul>",
    "<hr>",
    "<h2>What Can Node.js Do?</h2>",
    "<ul>",
    "<li>Node.js can generate dynamic page content</li>",
    "<li>Node.js can create, open, read, write, delete, and close files on the server</li>",
    "<li>Node.js can collect form data</li>",
    "<li>Node.js can add, delete, modify data in your database</li>",
    "</ul>"
  ],
  "npm":[
    "<h2>What is NPM and why do we need it?</h2>",
    "<p>NPM is the package manager for the Node JavaScript platform. ",
    "It puts modules in place so that node can find them, and manages dependency conflicts intelligently. ",
    "It is extremely configurable to support a wide variety of use cases. ",
    "Most commonly, it is used to publish, discover, install, and develop node programs.</p>",
    "<p>The main purpose of using npm is automated dependency and package management. ",
    "This means that you can specify all of your project's dependencies inside your <code>package.json</code> file. ",
    "Afterwards, when you want to get started with the project, all you need to do is running the command <code> npm install </code> and have all of the dependencies installed. </p>",
    "<p>It is also possible to manually download the libraries you need to use while developing. ",
    "However, as your project grows, this proccess will become time-consuming and messy. ",
    "Furthermore, it also makes collaborating and sharing your project much more difficult.</p>",
    "<hr>",
    "<h2>What is NPX?</h2>",
    "<p>NPX is a npm package runner that helps to execute packages without installing explicitly. ",
    "Therefore npx solves the problems of installing unnecessary packages just to look through. ",
    "It’s an easy way to avoid versioning problems and dependency issues.</p>"
  ],
  "commands":[
    "<h3>Running a node.js application</h3",
    "<p>The usual way to run a node.js program is to run the <code>node</code> globally available command and pass the name of the file you want to execute.</p>",
    "<p><code>node app.js</code></p>",
    "<p>Before running the command, make sure you are in the directory which contains the <code>app.js</code> file.</p>",
    "<hr>",
    "<p>Nodemon is a utility that will monitor for any changes in your source and automatically restart your server. Perfect for development. ",
    "Install it using npm.Just use nodemon instead of node to run your code, and now your process will automatically restart when your code changes. </p>",
    "<p><code> nodemon app.js</code></p>",
    "<hr>",
    "<h3>Terminating a node.js application</h3>",
    "<p>When running a program in the console/terminal, you can close it with <code> ctrl-c </code></p>"
  ],
  "utilities":[
    "<h2>Node.js Module</h2>",
    "<p>Module in Node.js is a simple or complex functionality organized in single or multiple JavaScript files which can be reused throughout the Node.js application.",
    "Each module in Node.js has its own context, so it cannot interfere with other modules or pollute global scope. ",
    "Also, each module can be placed in a separate .js file under a separate folder.</p>",
    "<hr>",
    "<h2>Express module</h2>",
    "<p><code>$ npm install express --save</code></p>",
    "<p>Express is a minimal and flexible Node.js web application framework that provides HTTP utility methods and middleware for web and mobile applications. ",
    "Express provides a thin layer of fundamental web application features, without obscuring Node.js features that you know and love.</p>",
    "<hr>",
    "<h2>Request - Simplified HTTP client</h2>",
    "<p>Request is designed to be the simplest way possible to make http calls. It supports HTTPS and follows redirects by default.</p>",
    "<hr>",
    "<h2>Nodemon</h2>",
    "<p>Nodemon is a utility that will monitor for any changes in your source and automatically restart your server. Perfect for development. ",
    "Install it using npm and then use nodemon instead of node to run your code, and now your process will automatically restart when your code changes. </p>",
    "<p><code>$ nodemon app.js</code></p>",
    "<hr>",
    "<h2>Budo</h2>",
    "<p>Budo is a browserify development server focused on incremental reloadin, LiveReload integration and other high-level features for rapid prototyping.</p>",
    "<p>To install it globally:</p>",
    "<p><code> npm install budo -g</code></p>",
    "<p>Running budo will start a server with default <code>index.html</code> and incrementally bundle your source on filesave. ",
    "The requests are delayed until the bundle has finished, so you will not be served stale or empty bundles if you refresh the page mid-update.</p>",
    "<hr>",
    "<h2>Cross-env</h2>",
    "<p>Cross-env  makes it so you can have a single command without worrying about setting or using the environment variable properly for the platform. ",
    "Just set it like you would if it's running on a POSIX system, and cross-env will take care of setting it properly.</p>"
  ],
  "restAPI":[
    "<h2>REST API</h2>",
    "<p>REST stands for REpresentational State Transfer. ",
    "REST is web standards based architecture and uses HTTP Protocol. ",
    "It revolves around resource where every component is a resource and a resource is accessed by a common interface using HTTP standard methods.",
    "A REST Server simply provides access to resources and REST client accesses and modifies the resources using HTTP protocol. ",
    "REST uses various representation to represent a resource like text, JSON, XML but JSON is the most popular one.</p>",
    "<h3>HTTP methods</h3>",
    "<ul>",
    "<p>Following four HTTP methods are commonly used in REST based architecture</p>",
    "<li><b>GET</b> - used to provide a read only access to a resource.</li>",
    "<li><b>PUT</b> - used to create a new resource.</li>",
    "<li><b>DELETE</b> - used to remove a resource.</li>",
    "<li><b>POST</b> - used to update a existing resource or create a new resource.</li>",
    "</ul>"
  ]
}